# Creating a Pandas DataFrame

A Dataframe is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. In dataframe datasets arrange in rows and columns, we can store any number of datasets in a dataframe. We can perform many operations on these datasets like arithmetic operation, columns/rows selection, columns/rows addition etc.

# Creating an empty dataframe : 
A basic DataFrame, which can be created is an Empty Dataframe. An Empty Dataframe is created just by calling a dataframe constructor.

In [51]:
import pandas as pd

In [52]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

# Creating a dataframe using List: 
DataFrame can be created using a single list or a list of lists.

In [53]:
li = ['rahul','is','trained','by','naruto','uzhumaki']
df = pd.DataFrame(li)
df

          0
0     rahul
1        is
2   trained
3        by
4    naruto
5  uzhumaki

# Creating DataFrame from dict of ndarray/lists:

In [54]:
di = {'Name' : ['Rahul','vishnu','Yash','Riya'],
       'Age' :['18','19','17','16']}
df = pd.DataFrame(di)
df

     Name Age
0   Rahul  18
1  vishnu  19
2    Yash  17
3    Riya  16

In [55]:
di = {'Name' : ['Rahul','vishnu','Yash','Riya','Venkat','Uma'],
       'Age' :['18','19','17','16','45','36'],
       'Score':['99','98','76','100','98','98']}
df = pd.DataFrame(di)
df

     Name Age Score
0   Rahul  18    99
1  vishnu  19    98
2    Yash  17    76
3    Riya  16   100
4  Venkat  45    98
5     Uma  36    98

Parameters:
data: It is a dataset from which a DataFrame is to be created. It can be a list, dictionary, scalar value, series, and arrays, etc.
index: It is optional, by default the index of the DataFrame starts from 0 and ends at the last data value(n-1). It defines the row label explicitly.
columns: This parameter is used to provide column names in the DataFrame. If the column name is not defined by default, it will take a value from 0 to n-1.

# Create DataFrame from lists of lists

In [56]:
li = [['Rahul','18'],['virat','17'],['AbD','16']]

In [57]:
DF = pd.DataFrame(li,columns = ['Name','Age'])
DF

    Name Age
0  Rahul  18
1  virat  17
2    AbD  16

# Create DataFrame from a dictionary of Series

In [58]:
d = {'Rno': pd.Series(np.arange(10,15,1),index = [111,112,113,114,115])}

df = pd.DataFrame(d)
df

     Rno
111   10
112   11
113   12
114   13
115   14

# Create DataFrame using the zip() function

In [59]:
name = ['rahul','venkat','uma','anbarasi']
age = [11,44,55,45]
li = list(zip(name,age))

df = pd.DataFrame(li,columns = ['Name','Age'])
df

       Name  Age
0     rahul   11
1    venkat   44
2       uma   55
3  anbarasi   45

# Python Pandas Series

Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

# Creating a series from array:

In [60]:
import numpy as np
data =np.array (['r','a','h','u','l'])
data

array(['r', 'a', 'h', 'u', 'l'], dtype='<U1')

In [61]:
df = pd.Series(data)
print(df)

0    r
1    a
2    h
3    u
4    l
dtype: object

# Creating a series from array with an index

In [62]:
import numpy as np
data =np.array (['r','a','h','u','l','','v','e','n','k','a','t','e','s','a','n'])
data

array(['r', 'a', 'h', 'u', 'l', '', 'v', 'e', 'n', 'k', 'a', 't', 'e',
       's', 'a', 'n'], dtype='<U1')

In [63]:
df = pd.Series(data,index = [100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115
                               ])
df

100    r
101    a
102    h
103    u
104    l
105
106    v
107    e
108    n
109    k
110    a
111    t
112    e
113    s
114    a
115    n
dtype: object

# Creating a series from Lists:

In [64]:
li = ['r','a','h','u','l']
df = pd.Series(li)
df

0    r
1    a
2    h
3    u
4    l
dtype: object

# Creating a series from Lists:

In [65]:
dict = {'Rahul' : 5,
        'venkat' : 6}
df = pd.Series(dict)
df

Rahul     5
venkat    6
dtype: int64

# Creating a series using NumPy functions : I

In [66]:
df = pd.Series(np.arange(1,100,10))
df

0     1
1    11
2    21
3    31
4    41
5    51
6    61
7    71
8    81
9    91
dtype: int32

In [67]:
df = pd.Series(np.linspace(1,100,3))
df

0      1.0
1     50.5
2    100.0
dtype: float64